{
  "architectures": [
    "ElectraForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "embedding_size": 768,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "\ubd84\ub178",
    "1": "\uc2ac\ud514",
    "2": "\ubd88\uc548",
    "3": "\uc0c1\ucc98",
    "4": "\ub2f9\ud669",
    "5": "\uae30\uc068"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "\uae30\uc068": 5,
    "\ub2f9\ud669": 4,
    "\ubd84\ub178": 0,
    "\ubd88\uc548": 2,
    "\uc0c1\ucc98": 3,
    "\uc2ac\ud514": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 35000
}
